app/views/projects/_form.html.erb

		<div class="field">
			<% if @project.images.exists? %>
---
SELECT "images".* FROM "images" WHERE "images"."project_id" = 4
SELECT 1 AS one FROM "images" WHERE "images"."project_id" IS NULL LIMIT 1