app/views/projects/index.html.erb

    <h4><%= project.name %></h4>
    <%= link_to (image_tag project.images.find(:first).image_url(:thumb).to_s), project %>
---
SELECT "images".* FROM "images" WHERE "images"."project_id" = 4