app/controllers/projects_controller.rb

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("created_at", "description", "name", "role", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", "8"]]